junkreef/F280025C_LP_IndependentStudy_DRV8434S/F280025C_LP_IndependentStudy_DRV8434S/driverlib/inc/hw_erad.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CTM_INPUT_COND register
//
//*************************************************************************************************
#define ERAD_CTM_INPUT_COND_CTM_INP_INV     0x1U      // Counter Input Invert
#define ERAD_CTM_INPUT_COND_CTM_INP_SYNCH   0x2U      // Counter input synchronizer enable
#define ERAD_CTM_INPUT_COND_STA_INP_INV     0x10U     // Start input Invert
#define ERAD_CTM_INPUT_COND_STA_INP_SYNCH   0x20U     // Start input synchronizer enable
#define ERAD_CTM_INPUT_COND_STO_INP_INV     0x100U    // Stop input Invert
#define ERAD_CTM_INPUT_COND_STO_INP_SYNCH   0x200U    // Stop input synchronizer enable
#define ERAD_CTM_INPUT_COND_RST_INP_INV     0x1000U   // Reset input Invert
#define ERAD_CTM_INPUT_COND_RST_INP_SYNCH   0x2000U   // Reset input synchronizer enable


//*************************************************************************************************
//
// The following are defines for the bit fields in the CRC_GLOBAL_CTRL register
//
//*************************************************************************************************
#define ERAD_CRC_GLOBAL_CTRL_CRC1_INIT   0x1U      // Initialize CRC Module 1
#define ERAD_CRC_GLOBAL_CTRL_CRC2_INIT   0x2U      // Initialize CRC Module 2
#define ERAD_CRC_GLOBAL_CTRL_CRC3_INIT   0x4U      // Initialize CRC Module 3
#define ERAD_CRC_GLOBAL_CTRL_CRC4_INIT   0x8U      // Initialize CRC Module 4
#define ERAD_CRC_GLOBAL_CTRL_CRC5_INIT   0x10U     // Initialize CRC Module 5
#define ERAD_CRC_GLOBAL_CTRL_CRC6_INIT   0x20U     // Initialize CRC Module 6
#define ERAD_CRC_GLOBAL_CTRL_CRC7_INIT   0x40U     // Initialize CRC Module 7
#define ERAD_CRC_GLOBAL_CTRL_CRC8_INIT   0x80U     // Initialize CRC Module 8
#define ERAD_CRC_GLOBAL_CTRL_CRC1_EN     0x100U    // Enable CRC Module 1
#define ERAD_CRC_GLOBAL_CTRL_CRC2_EN     0x200U    // Enable CRC Module 2
#define ERAD_CRC_GLOBAL_CTRL_CRC3_EN     0x400U    // Enable CRC Module 3
#define ERAD_CRC_GLOBAL_CTRL_CRC4_EN     0x800U    // Enable CRC Module 4
#define ERAD_CRC_GLOBAL_CTRL_CRC5_EN     0x1000U   // Enable CRC Module 5
#define ERAD_CRC_GLOBAL_CTRL_CRC6_EN     0x2000U   // Enable CRC Module 6
#define ERAD_CRC_GLOBAL_CTRL_CRC7_EN     0x4000U   // Enable CRC Module 7
#define ERAD_CRC_GLOBAL_CTRL_CRC8_EN     0x8000U   // Enable CRC Module 8


//*************************************************************************************************
//
// The following are defines for the bit fields in the CRC_QUALIFIER register
//
//*************************************************************************************************
#define ERAD_CRC_QUALIFIER_CRC_QUALIFIER_S   0U
#define ERAD_CRC_QUALIFIER_CRC_QUALIFIER_M   0x1FU   // CRC Qualifier Register



#endif
